tap "homebrew/bundle"

brew "git"
brew "neovim"
brew "node"
brew "rcm"
brew "ripgrep"
brew "spaceship"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "lazygit"

cask "1password"
cask "chatgpt"
cask "docker"
cask "git-credential-manager"
cask "insomnia"
cask "notion"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zoom"

vscode "asvetliakov.vscode-neovim"
vscode "enkia.tokyo-night"
vscode "extr0py.vscode-relative-line-numbers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "wayou.vscode-todo-highlight"
vscode "zhuangtongfa.material-theme"
